SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG23/Include/efr32fg23_frc.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG23 FRC register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG23_FRC_H
#define EFR32FG23_FRC_H
#define FRC_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG23_FRC FRC
 * @{
 * @brief EFR32FG23 FRC Register Declaration.
 *****************************************************************************/

/** FRC FCD Register Group Declaration. */
typedef struct {
  __IOM uint32_t FCD;                                /**< Frame Control Descriptor                           */
} FRC_FCD_TypeDef;

/** FRC INTELEMENT Register Group Declaration. */
typedef struct {
  __IM uint32_t INTELEMENT;                          /**< Interleaver element value                          */
} FRC_INTELEMENT_TypeDef;

/** FRC Register Declaration. */
typedef struct {
  __IM uint32_t          IPVERSION;             /**< IP Version                                         */
  __IOM uint32_t         EN;                    /**< Enable peripheral clock to this module             */
  __IM uint32_t          STATUS;                /**< FRC Status                                         */
  __IOM uint32_t         DFLCTRL;               /**< Dynamic Frame Length Control                       */
  __IOM uint32_t         MAXLENGTH;             /**< Maximum Frame Length Register                      */
  __IOM uint32_t         ADDRFILTCTRL;          /**< Address Filter Control                             */
  __IOM uint32_t         DATABUFFER;            /**< Frame controller data buffer                       */
  __IM uint32_t          WCNT;                  /**< Word Counter Value Register                        */
  __IOM uint32_t         WCNTCMP0;              /**< Word Counter Compare 0                             */
  __IOM uint32_t         WCNTCMP1;              /**< Word Counter Compare 1                             */
  __IOM uint32_t         WCNTCMP2;              /**< Word Counter Compare 2                             */
  __IOM uint32_t         CMD;                   /**< FRC Commands                                       */
  __IOM uint32_t         WHITECTRL;             /**< Whitener Control                                   */
  __IOM uint32_t         WHITEPOLY;             /**< Whitener Polynomial                                */
  __IOM uint32_t         WHITEINIT;             /**< Whitener Initial Value                             */
  __IOM uint32_t         FECCTRL;               /**< Forward Error Correction Control                   */
  __IOM uint32_t         BLOCKRAMADDR;          /**< Block decoding RAM address register                */
  __IOM uint32_t         CONVRAMADDR;           /**< Convolutional decoding RAM address                 */
  __IOM uint32_t         CTRL;                  /**< Control Register                                   */
  __IOM uint32_t         RXCTRL;                /**< RX Control Register                                */
  __IOM uint32_t         TRAILTXDATACTRL;       /**< Trailing TX Data Control                           */
  __IOM uint32_t         TRAILRXDATA;           /**< Trailing RX Data                                   */
  __IM uint32_t          SCNT;                  /**< Sub-Frame Counter Value Register                   */
  __IOM uint32_t         CONVGENERATOR;         /**< Convolutional Coder Polynomials                    */
  __IOM uint32_t         PUNCTCTRL;             /**< Puncturing Control                                 */
  __IOM uint32_t         PAUSECTRL;             /**< Pause Control                                      */
  __IOM uint32_t         IF;                    /**< Frame Controller Interrupt Flags                   */
  __IOM uint32_t         IEN;                   /**< Interrupt Enable Register                          */
  __IM uint32_t          OTACNT;                /**< Over the air number of bits counter                */
  uint32_t               RESERVED0[1U];         /**< Reserved for future use                            */
  __IOM uint32_t         BUFFERMODE;            /**< FRC Buffer Control                                 */
  uint32_t               RESERVED1[2U];         /**< Reserved for future use                            */
  __IOM uint32_t         SNIFFCTRL;             /**< FRC Sniffer Control Register                       */
  __IOM uint32_t         AUXDATA;               /**< Auxiliary sniffer data output register             */
  __IOM uint32_t         RAWCTRL;               /**< Raw data control                                   */
  __IM uint32_t          RXRAWDATA;             /**< Receiver RAW data                                  */
  __IM uint32_t          PAUSEDATA;             /**< Receiver pause data                                */
  __IM uint32_t          LIKELYCONVSTATE;       /**< Most likely convolutional decoder state            */
  __IM uint32_t          INTELEMENTNEXT;        /**< Interleaver element value                          */
  __IOM uint32_t         INTWRITEPOINT;         /**< Interleaver write pointer                          */
  __IOM uint32_t         INTREADPOINT;          /**< Interleaver read pointer                           */
  __IOM uint32_t         AUTOCG;                /**< Automatic clock gating                             */
  __IOM uint32_t         CGCLKSTOP;             /**< Automatic clock gating                             */
  uint32_t               RESERVED2[1U];         /**< Reserved for future use                            */
  __IOM uint32_t         SEQIF;                 /**< SEQ Frame Controller Interrupt Flags               */
  __IOM uint32_t         SEQIEN;                /**< SEQ Interrupt Enable Register                      */
  __IOM uint32_t         WCNTCMP3;              /**< Word Counter Compare 3                             */
  __IOM uint32_t         BOICTRL;               /**< Bit of Interest Control                            */
  __IOM uint32_t         DSLCTRL;               /**< Dynamic Supp Length Control                        */
  __IOM uint32_t         WCNTCMP4;              /**< Word Counter Compare 4                             */
  __IOM uint32_t         WCNTCMP5;              /**< Word Counter Compare 5                             */
  __IOM uint32_t         PKTBUFCTRL;            /**< Packet Capture Buffer Ctrl                         */
  __IM uint32_t          PKTBUFSTATUS;          /**< Packet Capture Buffer Status                       */
  __IM uint32_t          PKTBUF0;               /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF1;               /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF2;               /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF3;               /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF4;               /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF5;               /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF6;               /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF7;               /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF8;               /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF9;               /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF10;              /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF11;              /**< Packet Capture Data Buffer                         */
  FRC_FCD_TypeDef        FCD[4U];               /**< Frame Descriptors                                  */
  uint32_t               RESERVED3[3U];         /**< Reserved for future use                            */
  FRC_INTELEMENT_TypeDef INTELEMENT[16U];       /**< Interleaver element                                */
  uint32_t               RESERVED4[935U];       /**< Reserved for future use                            */
  __IM uint32_t          IPVERSION_SET;         /**< IP Version                                         */
  __IOM uint32_t         EN_SET;                /**< Enable peripheral clock to this module             */
  __IM uint32_t          STATUS_SET;            /**< FRC Status                                         */
  __IOM uint32_t         DFLCTRL_SET;           /**< Dynamic Frame Length Control                       */
  __IOM uint32_t         MAXLENGTH_SET;         /**< Maximum Frame Length Register                      */
  __IOM uint32_t         ADDRFILTCTRL_SET;      /**< Address Filter Control                             */
  __IOM uint32_t         DATABUFFER_SET;        /**< Frame controller data buffer                       */
  __IM uint32_t          WCNT_SET;              /**< Word Counter Value Register                        */
  __IOM uint32_t         WCNTCMP0_SET;          /**< Word Counter Compare 0                             */
  __IOM uint32_t         WCNTCMP1_SET;          /**< Word Counter Compare 1                             */
  __IOM uint32_t         WCNTCMP2_SET;          /**< Word Counter Compare 2                             */
  __IOM uint32_t         CMD_SET;               /**< FRC Commands                                       */
  __IOM uint32_t         WHITECTRL_SET;         /**< Whitener Control                                   */
  __IOM uint32_t         WHITEPOLY_SET;         /**< Whitener Polynomial                                */
  __IOM uint32_t         WHITEINIT_SET;         /**< Whitener Initial Value                             */
  __IOM uint32_t         FECCTRL_SET;           /**< Forward Error Correction Control                   */
  __IOM uint32_t         BLOCKRAMADDR_SET;      /**< Block decoding RAM address register                */
  __IOM uint32_t         CONVRAMADDR_SET;       /**< Convolutional decoding RAM address                 */
  __IOM uint32_t         CTRL_SET;              /**< Control Register                                   */
  __IOM uint32_t         RXCTRL_SET;            /**< RX Control Register                                */
  __IOM uint32_t         TRAILTXDATACTRL_SET;   /**< Trailing TX Data Control                           */
  __IOM uint32_t         TRAILRXDATA_SET;       /**< Trailing RX Data                                   */
  __IM uint32_t          SCNT_SET;              /**< Sub-Frame Counter Value Register                   */
  __IOM uint32_t         CONVGENERATOR_SET;     /**< Convolutional Coder Polynomials                    */
  __IOM uint32_t         PUNCTCTRL_SET;         /**< Puncturing Control                                 */
  __IOM uint32_t         PAUSECTRL_SET;         /**< Pause Control                                      */
  __IOM uint32_t         IF_SET;                /**< Frame Controller Interrupt Flags                   */
  __IOM uint32_t         IEN_SET;               /**< Interrupt Enable Register                          */
  __IM uint32_t          OTACNT_SET;            /**< Over the air number of bits counter                */
  uint32_t               RESERVED5[1U];         /**< Reserved for future use                            */
  __IOM uint32_t         BUFFERMODE_SET;        /**< FRC Buffer Control                                 */
  uint32_t               RESERVED6[2U];         /**< Reserved for future use                            */
  __IOM uint32_t         SNIFFCTRL_SET;         /**< FRC Sniffer Control Register                       */
  __IOM uint32_t         AUXDATA_SET;           /**< Auxiliary sniffer data output register             */
  __IOM uint32_t         RAWCTRL_SET;           /**< Raw data control                                   */
  __IM uint32_t          RXRAWDATA_SET;         /**< Receiver RAW data                                  */
  __IM uint32_t          PAUSEDATA_SET;         /**< Receiver pause data                                */
  __IM uint32_t          LIKELYCONVSTATE_SET;   /**< Most likely convolutional decoder state            */
  __IM uint32_t          INTELEMENTNEXT_SET;    /**< Interleaver element value                          */
  __IOM uint32_t         INTWRITEPOINT_SET;     /**< Interleaver write pointer                          */
  __IOM uint32_t         INTREADPOINT_SET;      /**< Interleaver read pointer                           */
  __IOM uint32_t         AUTOCG_SET;            /**< Automatic clock gating                             */
  __IOM uint32_t         CGCLKSTOP_SET;         /**< Automatic clock gating                             */
  uint32_t               RESERVED7[1U];         /**< Reserved for future use                            */
  __IOM uint32_t         SEQIF_SET;             /**< SEQ Frame Controller Interrupt Flags               */
  __IOM uint32_t         SEQIEN_SET;            /**< SEQ Interrupt Enable Register                      */
  __IOM uint32_t         WCNTCMP3_SET;          /**< Word Counter Compare 3                             */
  __IOM uint32_t         BOICTRL_SET;           /**< Bit of Interest Control                            */
  __IOM uint32_t         DSLCTRL_SET;           /**< Dynamic Supp Length Control                        */
  __IOM uint32_t         WCNTCMP4_SET;          /**< Word Counter Compare 4                             */
  __IOM uint32_t         WCNTCMP5_SET;          /**< Word Counter Compare 5                             */
  __IOM uint32_t         PKTBUFCTRL_SET;        /**< Packet Capture Buffer Ctrl                         */
  __IM uint32_t          PKTBUFSTATUS_SET;      /**< Packet Capture Buffer Status                       */
  __IM uint32_t          PKTBUF0_SET;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF1_SET;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF2_SET;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF3_SET;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF4_SET;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF5_SET;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF6_SET;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF7_SET;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF8_SET;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF9_SET;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF10_SET;          /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF11_SET;          /**< Packet Capture Data Buffer                         */
  FRC_FCD_TypeDef        FCD_SET[4U];           /**< Frame Descriptors                                  */
  uint32_t               RESERVED8[3U];         /**< Reserved for future use                            */
  FRC_INTELEMENT_TypeDef INTELEMENT_SET[16U];   /**< Interleaver element                                */
  uint32_t               RESERVED9[935U];       /**< Reserved for future use                            */
  __IM uint32_t          IPVERSION_CLR;         /**< IP Version                                         */
  __IOM uint32_t         EN_CLR;                /**< Enable peripheral clock to this module             */
  __IM uint32_t          STATUS_CLR;            /**< FRC Status                                         */
  __IOM uint32_t         DFLCTRL_CLR;           /**< Dynamic Frame Length Control                       */
  __IOM uint32_t         MAXLENGTH_CLR;         /**< Maximum Frame Length Register                      */
  __IOM uint32_t         ADDRFILTCTRL_CLR;      /**< Address Filter Control                             */
  __IOM uint32_t         DATABUFFER_CLR;        /**< Frame controller data buffer                       */
  __IM uint32_t          WCNT_CLR;              /**< Word Counter Value Register                        */
  __IOM uint32_t         WCNTCMP0_CLR;          /**< Word Counter Compare 0                             */
  __IOM uint32_t         WCNTCMP1_CLR;          /**< Word Counter Compare 1                             */
  __IOM uint32_t         WCNTCMP2_CLR;          /**< Word Counter Compare 2                             */
  __IOM uint32_t         CMD_CLR;               /**< FRC Commands                                       */
  __IOM uint32_t         WHITECTRL_CLR;         /**< Whitener Control                                   */
  __IOM uint32_t         WHITEPOLY_CLR;         /**< Whitener Polynomial                                */
  __IOM uint32_t         WHITEINIT_CLR;         /**< Whitener Initial Value                             */
  __IOM uint32_t         FECCTRL_CLR;           /**< Forward Error Correction Control                   */
  __IOM uint32_t         BLOCKRAMADDR_CLR;      /**< Block decoding RAM address register                */
  __IOM uint32_t         CONVRAMADDR_CLR;       /**< Convolutional decoding RAM address                 */
  __IOM uint32_t         CTRL_CLR;              /**< Control Register                                   */
  __IOM uint32_t         RXCTRL_CLR;            /**< RX Control Register                                */
  __IOM uint32_t         TRAILTXDATACTRL_CLR;   /**< Trailing TX Data Control                           */
  __IOM uint32_t         TRAILRXDATA_CLR;       /**< Trailing RX Data                                   */
  __IM uint32_t          SCNT_CLR;              /**< Sub-Frame Counter Value Register                   */
  __IOM uint32_t         CONVGENERATOR_CLR;     /**< Convolutional Coder Polynomials                    */
  __IOM uint32_t         PUNCTCTRL_CLR;         /**< Puncturing Control                                 */
  __IOM uint32_t         PAUSECTRL_CLR;         /**< Pause Control                                      */
  __IOM uint32_t         IF_CLR;                /**< Frame Controller Interrupt Flags                   */
  __IOM uint32_t         IEN_CLR;               /**< Interrupt Enable Register                          */
  __IM uint32_t          OTACNT_CLR;            /**< Over the air number of bits counter                */
  uint32_t               RESERVED10[1U];        /**< Reserved for future use                            */
  __IOM uint32_t         BUFFERMODE_CLR;        /**< FRC Buffer Control                                 */
  uint32_t               RESERVED11[2U];        /**< Reserved for future use                            */
  __IOM uint32_t         SNIFFCTRL_CLR;         /**< FRC Sniffer Control Register                       */
  __IOM uint32_t         AUXDATA_CLR;           /**< Auxiliary sniffer data output register             */
  __IOM uint32_t         RAWCTRL_CLR;           /**< Raw data control                                   */
  __IM uint32_t          RXRAWDATA_CLR;         /**< Receiver RAW data                                  */
  __IM uint32_t          PAUSEDATA_CLR;         /**< Receiver pause data                                */
  __IM uint32_t          LIKELYCONVSTATE_CLR;   /**< Most likely convolutional decoder state            */
  __IM uint32_t          INTELEMENTNEXT_CLR;    /**< Interleaver element value                          */
  __IOM uint32_t         INTWRITEPOINT_CLR;     /**< Interleaver write pointer                          */
  __IOM uint32_t         INTREADPOINT_CLR;      /**< Interleaver read pointer                           */
  __IOM uint32_t         AUTOCG_CLR;            /**< Automatic clock gating                             */
  __IOM uint32_t         CGCLKSTOP_CLR;         /**< Automatic clock gating                             */
  uint32_t               RESERVED12[1U];        /**< Reserved for future use                            */
  __IOM uint32_t         SEQIF_CLR;             /**< SEQ Frame Controller Interrupt Flags               */
  __IOM uint32_t         SEQIEN_CLR;            /**< SEQ Interrupt Enable Register                      */
  __IOM uint32_t         WCNTCMP3_CLR;          /**< Word Counter Compare 3                             */
  __IOM uint32_t         BOICTRL_CLR;           /**< Bit of Interest Control                            */
  __IOM uint32_t         DSLCTRL_CLR;           /**< Dynamic Supp Length Control                        */
  __IOM uint32_t         WCNTCMP4_CLR;          /**< Word Counter Compare 4                             */
  __IOM uint32_t         WCNTCMP5_CLR;          /**< Word Counter Compare 5                             */
  __IOM uint32_t         PKTBUFCTRL_CLR;        /**< Packet Capture Buffer Ctrl                         */
  __IM uint32_t          PKTBUFSTATUS_CLR;      /**< Packet Capture Buffer Status                       */
  __IM uint32_t          PKTBUF0_CLR;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF1_CLR;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF2_CLR;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF3_CLR;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF4_CLR;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF5_CLR;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF6_CLR;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF7_CLR;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF8_CLR;           /**< Packet Capture Data Buffer                         */
  __IM uint32_t          PKTBUF9_CLR;           /**< Packet Capture Data Buffer                         */
