SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG23/Include/efr32fg23_frc.h
/* Bit fields for FRC PKTBUF6 */
#define _FRC_PKTBUF6_RESETVALUE                            0x00000000UL                          /**< Default value for FRC_PKTBUF6               */
#define _FRC_PKTBUF6_MASK                                  0xFFFFFFFFUL                          /**< Mask for FRC_PKTBUF6                        */
#define _FRC_PKTBUF6_PKTBUF24_SHIFT                        0                                     /**< Shift value for FRC_PKTBUF24                */
#define _FRC_PKTBUF6_PKTBUF24_MASK                         0xFFUL                                /**< Bit mask for FRC_PKTBUF24                   */
#define _FRC_PKTBUF6_PKTBUF24_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF6                */
#define FRC_PKTBUF6_PKTBUF24_DEFAULT                       (_FRC_PKTBUF6_PKTBUF24_DEFAULT << 0)  /**< Shifted mode DEFAULT for FRC_PKTBUF6        */
#define _FRC_PKTBUF6_PKTBUF25_SHIFT                        8                                     /**< Shift value for FRC_PKTBUF25                */
#define _FRC_PKTBUF6_PKTBUF25_MASK                         0xFF00UL                              /**< Bit mask for FRC_PKTBUF25                   */
#define _FRC_PKTBUF6_PKTBUF25_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF6                */
#define FRC_PKTBUF6_PKTBUF25_DEFAULT                       (_FRC_PKTBUF6_PKTBUF25_DEFAULT << 8)  /**< Shifted mode DEFAULT for FRC_PKTBUF6        */
#define _FRC_PKTBUF6_PKTBUF26_SHIFT                        16                                    /**< Shift value for FRC_PKTBUF26                */
#define _FRC_PKTBUF6_PKTBUF26_MASK                         0xFF0000UL                            /**< Bit mask for FRC_PKTBUF26                   */
#define _FRC_PKTBUF6_PKTBUF26_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF6                */
#define FRC_PKTBUF6_PKTBUF26_DEFAULT                       (_FRC_PKTBUF6_PKTBUF26_DEFAULT << 16) /**< Shifted mode DEFAULT for FRC_PKTBUF6        */
#define _FRC_PKTBUF6_PKTBUF27_SHIFT                        24                                    /**< Shift value for FRC_PKTBUF27                */
#define _FRC_PKTBUF6_PKTBUF27_MASK                         0xFF000000UL                          /**< Bit mask for FRC_PKTBUF27                   */
#define _FRC_PKTBUF6_PKTBUF27_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF6                */
#define FRC_PKTBUF6_PKTBUF27_DEFAULT                       (_FRC_PKTBUF6_PKTBUF27_DEFAULT << 24) /**< Shifted mode DEFAULT for FRC_PKTBUF6        */

/* Bit fields for FRC PKTBUF7 */
#define _FRC_PKTBUF7_RESETVALUE                            0x00000000UL                          /**< Default value for FRC_PKTBUF7               */
#define _FRC_PKTBUF7_MASK                                  0xFFFFFFFFUL                          /**< Mask for FRC_PKTBUF7                        */
#define _FRC_PKTBUF7_PKTBUF28_SHIFT                        0                                     /**< Shift value for FRC_PKTBUF28                */
#define _FRC_PKTBUF7_PKTBUF28_MASK                         0xFFUL                                /**< Bit mask for FRC_PKTBUF28                   */
#define _FRC_PKTBUF7_PKTBUF28_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF7                */
#define FRC_PKTBUF7_PKTBUF28_DEFAULT                       (_FRC_PKTBUF7_PKTBUF28_DEFAULT << 0)  /**< Shifted mode DEFAULT for FRC_PKTBUF7        */
#define _FRC_PKTBUF7_PKTBUF29_SHIFT                        8                                     /**< Shift value for FRC_PKTBUF29                */
#define _FRC_PKTBUF7_PKTBUF29_MASK                         0xFF00UL                              /**< Bit mask for FRC_PKTBUF29                   */
#define _FRC_PKTBUF7_PKTBUF29_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF7                */
#define FRC_PKTBUF7_PKTBUF29_DEFAULT                       (_FRC_PKTBUF7_PKTBUF29_DEFAULT << 8)  /**< Shifted mode DEFAULT for FRC_PKTBUF7        */
#define _FRC_PKTBUF7_PKTBUF30_SHIFT                        16                                    /**< Shift value for FRC_PKTBUF30                */
#define _FRC_PKTBUF7_PKTBUF30_MASK                         0xFF0000UL                            /**< Bit mask for FRC_PKTBUF30                   */
#define _FRC_PKTBUF7_PKTBUF30_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF7                */
#define FRC_PKTBUF7_PKTBUF30_DEFAULT                       (_FRC_PKTBUF7_PKTBUF30_DEFAULT << 16) /**< Shifted mode DEFAULT for FRC_PKTBUF7        */
#define _FRC_PKTBUF7_PKTBUF31_SHIFT                        24                                    /**< Shift value for FRC_PKTBUF31                */
#define _FRC_PKTBUF7_PKTBUF31_MASK                         0xFF000000UL                          /**< Bit mask for FRC_PKTBUF31                   */
#define _FRC_PKTBUF7_PKTBUF31_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF7                */
#define FRC_PKTBUF7_PKTBUF31_DEFAULT                       (_FRC_PKTBUF7_PKTBUF31_DEFAULT << 24) /**< Shifted mode DEFAULT for FRC_PKTBUF7        */

/* Bit fields for FRC PKTBUF8 */
#define _FRC_PKTBUF8_RESETVALUE                            0x00000000UL                          /**< Default value for FRC_PKTBUF8               */
#define _FRC_PKTBUF8_MASK                                  0xFFFFFFFFUL                          /**< Mask for FRC_PKTBUF8                        */
#define _FRC_PKTBUF8_PKTBUF32_SHIFT                        0                                     /**< Shift value for FRC_PKTBUF32                */
#define _FRC_PKTBUF8_PKTBUF32_MASK                         0xFFUL                                /**< Bit mask for FRC_PKTBUF32                   */
#define _FRC_PKTBUF8_PKTBUF32_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF8                */
#define FRC_PKTBUF8_PKTBUF32_DEFAULT                       (_FRC_PKTBUF8_PKTBUF32_DEFAULT << 0)  /**< Shifted mode DEFAULT for FRC_PKTBUF8        */
#define _FRC_PKTBUF8_PKTBUF33_SHIFT                        8                                     /**< Shift value for FRC_PKTBUF33                */
#define _FRC_PKTBUF8_PKTBUF33_MASK                         0xFF00UL                              /**< Bit mask for FRC_PKTBUF33                   */
#define _FRC_PKTBUF8_PKTBUF33_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF8                */
#define FRC_PKTBUF8_PKTBUF33_DEFAULT                       (_FRC_PKTBUF8_PKTBUF33_DEFAULT << 8)  /**< Shifted mode DEFAULT for FRC_PKTBUF8        */
#define _FRC_PKTBUF8_PKTBUF34_SHIFT                        16                                    /**< Shift value for FRC_PKTBUF34                */
#define _FRC_PKTBUF8_PKTBUF34_MASK                         0xFF0000UL                            /**< Bit mask for FRC_PKTBUF34                   */
#define _FRC_PKTBUF8_PKTBUF34_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF8                */
#define FRC_PKTBUF8_PKTBUF34_DEFAULT                       (_FRC_PKTBUF8_PKTBUF34_DEFAULT << 16) /**< Shifted mode DEFAULT for FRC_PKTBUF8        */
#define _FRC_PKTBUF8_PKTBUF35_SHIFT                        24                                    /**< Shift value for FRC_PKTBUF35                */
#define _FRC_PKTBUF8_PKTBUF35_MASK                         0xFF000000UL                          /**< Bit mask for FRC_PKTBUF35                   */
#define _FRC_PKTBUF8_PKTBUF35_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF8                */
#define FRC_PKTBUF8_PKTBUF35_DEFAULT                       (_FRC_PKTBUF8_PKTBUF35_DEFAULT << 24) /**< Shifted mode DEFAULT for FRC_PKTBUF8        */

/* Bit fields for FRC PKTBUF9 */
#define _FRC_PKTBUF9_RESETVALUE                            0x00000000UL                          /**< Default value for FRC_PKTBUF9               */
#define _FRC_PKTBUF9_MASK                                  0xFFFFFFFFUL                          /**< Mask for FRC_PKTBUF9                        */
#define _FRC_PKTBUF9_PKTBUF36_SHIFT                        0                                     /**< Shift value for FRC_PKTBUF36                */
#define _FRC_PKTBUF9_PKTBUF36_MASK                         0xFFUL                                /**< Bit mask for FRC_PKTBUF36                   */
#define _FRC_PKTBUF9_PKTBUF36_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF9                */
#define FRC_PKTBUF9_PKTBUF36_DEFAULT                       (_FRC_PKTBUF9_PKTBUF36_DEFAULT << 0)  /**< Shifted mode DEFAULT for FRC_PKTBUF9        */
#define _FRC_PKTBUF9_PKTBUF37_SHIFT                        8                                     /**< Shift value for FRC_PKTBUF37                */
#define _FRC_PKTBUF9_PKTBUF37_MASK                         0xFF00UL                              /**< Bit mask for FRC_PKTBUF37                   */
#define _FRC_PKTBUF9_PKTBUF37_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF9                */
#define FRC_PKTBUF9_PKTBUF37_DEFAULT                       (_FRC_PKTBUF9_PKTBUF37_DEFAULT << 8)  /**< Shifted mode DEFAULT for FRC_PKTBUF9        */
#define _FRC_PKTBUF9_PKTBUF38_SHIFT                        16                                    /**< Shift value for FRC_PKTBUF38                */
#define _FRC_PKTBUF9_PKTBUF38_MASK                         0xFF0000UL                            /**< Bit mask for FRC_PKTBUF38                   */
#define _FRC_PKTBUF9_PKTBUF38_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF9                */
#define FRC_PKTBUF9_PKTBUF38_DEFAULT                       (_FRC_PKTBUF9_PKTBUF38_DEFAULT << 16) /**< Shifted mode DEFAULT for FRC_PKTBUF9        */
#define _FRC_PKTBUF9_PKTBUF39_SHIFT                        24                                    /**< Shift value for FRC_PKTBUF39                */
#define _FRC_PKTBUF9_PKTBUF39_MASK                         0xFF000000UL                          /**< Bit mask for FRC_PKTBUF39                   */
#define _FRC_PKTBUF9_PKTBUF39_DEFAULT                      0x00000000UL                          /**< Mode DEFAULT for FRC_PKTBUF9                */
#define FRC_PKTBUF9_PKTBUF39_DEFAULT                       (_FRC_PKTBUF9_PKTBUF39_DEFAULT << 24) /**< Shifted mode DEFAULT for FRC_PKTBUF9        */

/* Bit fields for FRC PKTBUF10 */
#define _FRC_PKTBUF10_RESETVALUE                           0x00000000UL                           /**< Default value for FRC_PKTBUF10              */
#define _FRC_PKTBUF10_MASK                                 0xFFFFFFFFUL                           /**< Mask for FRC_PKTBUF10                       */
#define _FRC_PKTBUF10_PKTBUF40_SHIFT                       0                                      /**< Shift value for FRC_PKTBUF40                */
#define _FRC_PKTBUF10_PKTBUF40_MASK                        0xFFUL                                 /**< Bit mask for FRC_PKTBUF40                   */
#define _FRC_PKTBUF10_PKTBUF40_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for FRC_PKTBUF10               */
#define FRC_PKTBUF10_PKTBUF40_DEFAULT                      (_FRC_PKTBUF10_PKTBUF40_DEFAULT << 0)  /**< Shifted mode DEFAULT for FRC_PKTBUF10       */
#define _FRC_PKTBUF10_PKTBUF41_SHIFT                       8                                      /**< Shift value for FRC_PKTBUF41                */
#define _FRC_PKTBUF10_PKTBUF41_MASK                        0xFF00UL                               /**< Bit mask for FRC_PKTBUF41                   */
#define _FRC_PKTBUF10_PKTBUF41_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for FRC_PKTBUF10               */
#define FRC_PKTBUF10_PKTBUF41_DEFAULT                      (_FRC_PKTBUF10_PKTBUF41_DEFAULT << 8)  /**< Shifted mode DEFAULT for FRC_PKTBUF10       */
#define _FRC_PKTBUF10_PKTBUF42_SHIFT                       16                                     /**< Shift value for FRC_PKTBUF42                */
#define _FRC_PKTBUF10_PKTBUF42_MASK                        0xFF0000UL                             /**< Bit mask for FRC_PKTBUF42                   */
#define _FRC_PKTBUF10_PKTBUF42_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for FRC_PKTBUF10               */
#define FRC_PKTBUF10_PKTBUF42_DEFAULT                      (_FRC_PKTBUF10_PKTBUF42_DEFAULT << 16) /**< Shifted mode DEFAULT for FRC_PKTBUF10       */
#define _FRC_PKTBUF10_PKTBUF43_SHIFT                       24                                     /**< Shift value for FRC_PKTBUF43                */
#define _FRC_PKTBUF10_PKTBUF43_MASK                        0xFF000000UL                           /**< Bit mask for FRC_PKTBUF43                   */
#define _FRC_PKTBUF10_PKTBUF43_DEFAULT                     0x00000000UL                           /**< Mode DEFAULT for FRC_PKTBUF10               */
#define FRC_PKTBUF10_PKTBUF43_DEFAULT                      (_FRC_PKTBUF10_PKTBUF43_DEFAULT << 24) /**< Shifted mode DEFAULT for FRC_PKTBUF10       */

